src/test/java/course-requesthomework2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:soap="http://kodilla.com/courses/soap">
    <soapenv:Header/>
    <soapenv:Body>
        <soap:getCourseRequest>
            <soap:name>Tester Automatyzujący</soap:name>
        </soap:getCourseRequest>
    </soapenv:Body>
</soapenv:Envelope>